app/views/statuses/_form.html.erb

SELECT "users".* FROM "users"
---

  <%= f.input :user_id, collection: User.all, label_method: :profile_name %>