app/controllers/statuses_controller.rb

  def create
    @status = Status.new(params[:status])

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("content", "created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "Helllllo"], ["created_at", Sat, 12 Oct 2013 16:57:32 UTC +00:00], ["name", nil], ["updated_at", Sat, 12 Oct 2013 16:57:32 UTC +00:00], ["user_id", 2]]

  def update
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "980190962"]]